Autodesk.Revit.Creation.ItemFactoryBase.NewAlignment(Autodesk.Revit.DB.View,Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.Reference)
Add a new locked alignment into the Autodesk Revit document.
view: The view that determines the orientation of the alignment.
reference1:  The first reference.
reference2:  The second reference.
Returns: If creation was successful the new locked alignment dimension is returned,
otherwise an exception with failure information will be thrown.
Remarks: These two references must be one of the following combinations:
2 planar facesplanar face and reference plane2 linesline and pointline and reference plane2 arcs2 cylindrical faces
These references must be already geometrically aligned (this function will
not force them to become aligned).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument-"view" or "headerReference" or "otherReference"-is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the input argument-"headerReference" or "otherReference"-is invalid.

Autodesk.Revit.Creation.ItemFactoryBase.PlaceGroup(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.GroupType)
Place an instance of a Model Group into the Autodesk Revit document, using a location
and a group type.
location: The physical location where the group is to be placed.
groupType: A GroupType object that represents the type of group that is to be placed.
Returns: If creation was successful then an instance to the new group is returned, otherwise null.
Remarks: This method is used to place a new instance of an existing group type within the document.
The group's origin will placed at the point specified by the location. All group types within the
document can be found by iterating over the document and looking for elements of type
Autodesk.Revit.DB.GroupType.

Autodesk.Revit.Creation.ItemFactoryBase.NewReferencePlane2(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.View)
Creates a new instance of ReferencePlane.
bubbleEnd:  The bubble end applied to reference plane.
freeEnd:  The free end applied to reference plane.
thirdPnt:  A third point needed to define the reference plane.
pView:  The specific view apply to the Reference plane.
Returns:  The newly created reference plane.

Autodesk.Revit.Creation.ItemFactoryBase.NewReferencePlane(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.View)
Creates a new instance of ReferencePlane.
bubbleEnd:  The bubble end applied to reference plane.
freeEnd:  The free end applied to reference plane.
cutVec:  The cut vector apply to reference plane, should perpendicular
to the vector  (bubbleEnd-freeEnd).
pView:  The specific view apply to the Reference plane.
Returns:  The newly created reference plane.

Autodesk.Revit.Creation.ItemFactoryBase.NewModelCurveArray(Autodesk.Revit.DB.CurveArray,Autodesk.Revit.DB.SketchPlane)
Creates an array of new model line elements.
geometryCurveArray:  An array containing the internal geometry curves for model lines.
Returns:  If successful an array of new model line elements. Otherwise null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when curve is not in the plane

Autodesk.Revit.Creation.ItemFactoryBase.NewModelCurve(Autodesk.Revit.DB.Curve,Autodesk.Revit.DB.SketchPlane)
Creates a new model line element.
geometryCurve:  The internal geometry curve for model line.
sketchPlane: The sketch plane this new model line resides in.
Returns:  If successful a new model line element. Otherwise null.
Remarks:  Different type of model curve element will be returned according to the type of geometry curve.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when curve is not in the plane

Autodesk.Revit.Creation.ItemFactoryBase.NewGroup(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Creates a new type of group.
elementIds: A set of elements which will be made into the new group.
Returns: A new instance of a group containing the elements specified.
Remarks:
The new group may contain more members than just the set input to this method.  Elements
which are closely connected with the inputs (such as sketch and sketch plane) will also be added to
the group.
Initially the group will have a generic name, such as Group 1. This can be changed by
changing the name of the group type as follows: newGroup.GroupType.Name = newName.
If a newly-created element is being added to a group, calling document.Regenerate() may be needed to avoid
a warning visible in the UI that the group has changed outside group edit mode.

Autodesk.Revit.Creation.ItemFactoryBase.NewFamilyInstances2(System.Collections.Generic.List{Autodesk.Revit.Creation.FamilyInstanceCreationData})
Creates Family instances within the document.
dataList:  A list of FamilyInstanceCreationData which wraps the creation arguments of the families to be created.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: If FamilyInstanceCreationData's 'curve' or 'symbol' member is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: If regeneration fails at the end of the batch creation.
Returns:  If the creation is successful, a set of ElementIds which contains the Family instances should be returned, otherwise the exception will be thrown.
Remarks:
Note: ForbiddenForDynamicUpdateException might be thrown during a dynamic update if the inserted instance establishes a mutual dependency with another structure.
Note: if the created family instance includes nested instances, the API framework will automatically regenerate
the document during this method call.

Autodesk.Revit.Creation.ItemFactoryBase.NewFamilyInstance(Autodesk.Revit.DB.Line,Autodesk.Revit.DB.FamilySymbol,Autodesk.Revit.DB.View)
Add a line based detail family instance into the Autodesk Revit document,
using an line and a view where the instance should be placed.
line: The line location of family instance. The line must in the plane of the view.
symbol: A family symbol object that represents the type of the instance that is to be inserted.
specView: A 2D view in which to display the family instance.
Remarks: This overload applies only to 2D family line based detail symbols.
The type/symbol that is used must be loaded into the document before this method is called.
Families and their symbols can be loaded using the Document.LoadFamily
or Document.LoadFamilySymbol methods.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when input argument line or symbol or specView is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when input argument line or symbol or specView is invalid,
or cannot make such type in the specView,
or the line is not in the plane of specView.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when failed to create the instance.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when attempting to place a model-based family.  Only 2D detail families can be placed in views.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if The symbol is not active.

Autodesk.Revit.Creation.ItemFactoryBase.NewFamilyInstance(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.FamilySymbol,Autodesk.Revit.DB.View)
Add a new family instance into the Autodesk Revit document,
using an origin and a view where the instance should be placed.
origin: The origin of family instance. If created on a Autodesk.Revit.DB.ViewPlan,
the origin will be projected onto the Autodesk.Revit.DB.ViewPlan.
symbol: A family symbol object that represents the type of the instance that is to be inserted.
specView: The 2D view in which to place the family instance.
Returns: If creation was successful then an instance to the new object is returned.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: One or more required arguments was null
Throws Autodesk.Revit.Exceptions.ArgumentException: The input family PlacementType was not ViewBased, the input view was not 2D,
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if The symbol is not active.
or instances of the input FamilySymbol are not permitted on a view of this type.
Remarks: This overload applies only to 2D family symbols (detail components, annotation symbols, titleblocks, etc.).
The type/symbol that is used must be loaded into the document before this method is called.
Families and their symbols can be loaded using the Document.LoadFamily or Document.LoadFamilySymbol methods.

Autodesk.Revit.Creation.ItemFactoryBase.NewFamilyInstance(Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.Line,Autodesk.Revit.DB.FamilySymbol)
Inserts a new instance of a family onto a face referenced by the input Reference instance,
using a line on that face for its position, and a type/symbol.
reference: A reference to a face.
position: A line on the face defining where the symbol is to be placed.
symbol: A FamilySymbol object that represents the type of the instance that is to be inserted.
Note that this symbol must represent a family whose Autodesk.Revit.DB.Family.FamilyPlacementType
is WorkPlaneBased or CurveBased.
Returns: An instance of the new object if creation was successful, otherwise null.
Remarks: Use this method to insert one family instance on a face of another element,
using a line on the face to define the position and direction of the new symbol.
The type/symbol that is used must be loaded into the document before this method
is called. Families and their symbols can be loaded using the Document.LoadFamily or
Document.LoadFamilySymbol methods.The host object must support insertion of instances, otherwise this method
will fail. If the instance fails to be created an exception may be thrown.Note: if the created family instance includes nested instances, the API framework will automatically regenerate
the document during this method call.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when a non-optional argument was null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when the function
cannot get a face from the reference, or, when the family
cannot be placed as line-based on an input face reference, because its FamilyPlacementType is not WorkPlaneBased or
CurveBased
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException: Thrown when the family cannot be placed on
this line as it does not coincide with the input face.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when Revit is unable to place the family
instance.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if The symbol is not active.

Autodesk.Revit.Creation.ItemFactoryBase.NewFamilyInstance(Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.FamilySymbol)
Inserts a new instance of a family onto a face referenced by the input Reference instance,
using a location, reference direction, and a type/symbol.
reference: A reference to a face.
location: Point on the face where the instance is to be placed.
referenceDirection: A vector that defines the direction of the family instance.
Note that this direction defines the rotation of the instance on the face, and thus cannot be parallel
to the face normal.
symbol: A FamilySymbol object that represents the type of the instance that is to be inserted.
Note that this symbol must represent a family whose Autodesk.Revit.DB.Family.FamilyPlacementType
is WorkPlaneBased.
Returns: An instance of the new object if creation was successful, otherwise null.
Remarks: Use this method to insert one family instance on a face of another element,
using a point on the face and a vector to define the position and direction of the new symbol.
The type/symbol that is used must be loaded into the document before this method is called.
Families and their symbols can be loaded using the Document.LoadFamily or
Document.LoadFamilySymbol methods.The host object must support insertion of instances, otherwise this method
will fail. If the instances fails to be created an exception may be thrown.Some Families, such as Beams, have more than one endpoint and are inserted
in the same manner as single point instances. Once inserted, these linear family instances
can have their endpoints changed by using the instance's Element.Location property.Note: if the created family instance includes nested instances, the API framework will automatically regenerate
the document during this method call.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when a non-optional argument was null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when the function cannot get the face from
the reference, or, when the Family cannot be placed as line-based on an input face reference, because its FamilyPlacementType
is not WorkPlaneBased
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException: Thrown when reference direction is
parallel to face normal at insertion point.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when Revit is unable to place the family
instance.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if The symbol is not active.

Autodesk.Revit.Creation.ItemFactoryBase.NewFamilyInstance(Autodesk.Revit.DB.Face,Autodesk.Revit.DB.Line,Autodesk.Revit.DB.FamilySymbol)
Inserts a new instance of a family onto a face of an existing element,
using a line on that face for its position, and a type/symbol.
face: A face of a geometry object.
position: A line on the face defining where the symbol is to be placed.
symbol: A FamilySymbol object that represents the type of the instance that is to be inserted.
Note that this symbol must represent a family whose Autodesk.Revit.DB.Family.FamilyPlacementType
is WorkPlaneBased or CurveBased.
Returns: An instance of the new object if creation was successful, otherwise null.
Remarks: Use this method to insert one family instance on a face of another element,
using a line on the face to define the position and direction of the new symbol.
The type/symbol that is used must be loaded into the document before this method
is called. Families and their symbols can be loaded using the Document.LoadFamily or
Document.LoadFamilySymbol methods.The host object must support insertion of instances, otherwise this method
will fail. If the instance fails to be created an exception may be thrown.Note: if the created family instance includes nested instances, the API framework will automatically regenerate
the document during this method call.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when a non-optional argument was null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when the function cannot get the Reference
from the face, or, Family cannot be placed as line-based on an input face reference, because its FamilyPlacementType
is not WorkPlaneBased or CurveBased
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException: Thrown when the family cannot be placed on
this line as it does not coincide with the input face.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when Revit is unable to place the family
instance.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if The symbol is not active.

Autodesk.Revit.Creation.ItemFactoryBase.NewFamilyInstance(Autodesk.Revit.DB.Face,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.FamilySymbol)
Inserts a new instance of a family onto a face of an existing element,
using a location, reference direction, and a type/symbol.
face: A face of a geometry object.
location: Point on the face where the instance is to be placed.
referenceDirection: A vector that defines the direction of the family instance.
Note that this direction defines the rotation of the instance on the face, and thus cannot be parallel
to the face normal.
symbol: A FamilySymbol object that represents the type of the instance that is to be inserted.
Note that this symbol must represent a family whose Autodesk.Revit.DB.Family.FamilyPlacementType
is WorkPlaneBased.
Returns: An instance of the new object if creation was successful, otherwise null.
Remarks: Use this method to insert one family instance on a face of another element,
using a point on the face and a vector to define the position and direction of the new symbol.
The type/symbol that is used must be loaded into the document before this method is called.
Families and their symbols can be loaded using the Document.LoadFamily or
Document.LoadFamilySymbol methods.The host object must support insertion of instances, otherwise this method
will fail. If the instances fails to be created an exception may be thrown.Some Families, such as Beams, have more than one endpoint and are inserted
in the same manner as single point instances. Once inserted, these linear family instances
can have their endpoints changed by using the instance's Element.Location property.Note: if the created family instance includes nested instances, the API framework will automatically regenerate
the document during this method call.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when a non-optional argument was null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when the function cannot get the Reference
from the face, or, when the Family cannot be placed as line-based on an input face reference, because its FamilyPlacementType
is not WorkPlaneBased
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException: Thrown when reference direction is
parallel to face normal at insertion point.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when Revit is unable to place the family
instance.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if The symbol is not active.

Autodesk.Revit.Creation.ItemFactoryBase.NewFamilyInstance(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.FamilySymbol,Autodesk.Revit.DB.Structure.StructuralType)
Inserts a new instance of a family into the document, using a location and a
type/symbol.
location: The physical location where the instance is to be placed.
symbol: A FamilySymbol object that represents the type of the instance that is to be inserted.
structuralType:  If structural then specify the type of the component.
Returns: A valid instance of the given family if the creation is successful. An exception will be thrown otherwise.
Remarks: Use this method to insert a family instance that does not require a host element or level.
For creating instances of level-based families use one of the NewFamilyInstance methods of the Revit.Creation.Document class.
The type/symbol that is used must be loaded into the document before this method is called.
Families and their symbols can be loaded using the Document.LoadFamily or
Document.LoadFamilySymbol methods.Some Families, such as Beams, have more than one endpoint
and are inserted in the same manner as single point instances. Once inserted these linear family
instances can have their endpoints changed by using the instance's Element.Location property.Note: if the created family instance includes nested instances, the API framework will automatically regenerate
the document during this method call.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the symbol is not active.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if the family is level-based, for new instances of such families require a valid level to be supplied at the time of creation.

Autodesk.Revit.Creation.ItemFactoryBase.NewFamilyInstance(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.FamilySymbol,Autodesk.Revit.DB.Element,Autodesk.Revit.DB.Structure.StructuralType)
Inserts a new instance of a family into the document,
using a location, type/symbol, and the host element.
location: The physical location where the instance is to be placed.
symbol: A FamilySymbol object that represents the type of the instance that is to be inserted.
host: The object into which the FamilyInstance is to be inserted, often known as the host.
structuralType:  If structural then specify the type of the component.
Returns: If creation was successful then an instance to the new object is returned, otherwise null.
Remarks: This method is used to insert one family instance into another element, such as inserting a
window into a wall. If the instance fails to be created an exception may be thrown.
The type/symbol that is used must be loaded into the document
before this method is called. Families and their symbols can be loaded using the Document.LoadFamily
or Document.LoadFamilySymbol methods. The host object must be one that supports insertion of
instances otherwise this method will fail. Some Families, such as Beams, have more than one endpoint
and are inserted in the same manner as single point instances. Once inserted these linear family
instances can have their endpoints changed by using the instance's Element.Location property.Note: ForbiddenForDynamicUpdateException might be thrown during a dynamic update if the inserted instance establishes a mutual dependency with another structure.Note: if the created family instance includes nested instances, the API framework will automatically regenerate
the document during this method call.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if The symbol is not active.

Autodesk.Revit.Creation.ItemFactoryBase.NewFamilyInstance(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.FamilySymbol,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.Element,Autodesk.Revit.DB.Structure.StructuralType)
Inserts a new instance of a family into the document.
Inserts a new instance of a family into the document,
using a location, type/symbol, the host element and a reference direction.
location: The physical location where the instance is to be placed.
symbol: A FamilySymbol object that represents the type of the instance that is to be inserted.
referenceDirection:  A vector that dictates the direction of certain family instances.
host:  A host object into which the instance will be embedded
structuralType:  If structural then specify the type of the component.
Returns: If creation was successful then an instance to the new object is returned, otherwise null.
Remarks: This method allows you to create FamilyInstance objects that require both a location and direction.
If the instance fails to be created an exception may be thrown.
The type/symbol that is used must be loaded into the document
before this method is called. Families and their symbols can be loaded using the Document.LoadFamily
or Document.LoadFamilySymbol methods. Some Families, such as Beams, have more than one endpoint and
are inserted in the same manner as single point instances. Once inserted these linear family instances
can have their endpoints changed by using the instance's Element.Location property.Note: if the created family instance includes nested instances, the API framework will automatically regenerate
the document during this method call.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if The symbol is not active.

Autodesk.Revit.Creation.ItemFactoryBase.NewDimension(Autodesk.Revit.DB.View,Autodesk.Revit.DB.Line,Autodesk.Revit.DB.ReferenceArray,Autodesk.Revit.DB.DimensionType)
Creates a new linear dimension object using the specified dimension style.
view:  The view in which the dimension is to be visible.
line:  The line drawn for the dimension.
references:  An array of geometric references to which the dimension is to be bound.
dimensionType:  The dimension style to be used for the dimension.
Returns:  If successful a new dimension object, otherwise null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when references are not geometric references.

Autodesk.Revit.Creation.ItemFactoryBase.NewDimension(Autodesk.Revit.DB.View,Autodesk.Revit.DB.Line,Autodesk.Revit.DB.ReferenceArray)
Creates a new linear dimension object.
Creates a new linear dimension object using the default dimension style.
view:  The view in which the dimension is to be visible.
line:  The line drawn for the dimension.
references:  An array of geometric references to which the dimension is to be bound.
Returns:  If successful a new dimension object, otherwise null.
Remarks:  The currently user set default style is used for the created dimension.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when references are not geometric references.

Autodesk.Revit.Creation.ItemFactoryBase.NewDetailCurveArray(Autodesk.Revit.DB.View,Autodesk.Revit.DB.CurveArray)
Creates an array of new detail curve elements.
view:  The view in which the detail curves are to be visible.
geometryCurveArray:  An array containing the internal geometry curves for detail lines.
The curve in array should be bound curve.
Returns:  If successful an array of new detail curve elements. Otherwise null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when curve is not in plane of the view

Autodesk.Revit.Creation.ItemFactoryBase.NewDetailCurve(Autodesk.Revit.DB.View,Autodesk.Revit.DB.Curve)
Creates a new detail curve element.
view:  The view in which the detail curve is to be visible.
geometryCurve:  The internal geometry curve for detail curve. It should be a bound curve.
Returns:  If successful a new detail curve element. Otherwise null.
Remarks:  Different type of detail curve element will be returned according to the type of geometry curve.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when curve is not in plane of the view

Autodesk.Revit.Creation.ItemFactoryBase
The ItemFactoryBase object is used to create new instances of elements within the
Autodesk Revit document.
Remarks: The ItemFactoryBase object is a utility object that is used to create new
instances of elements within the Autodesk Revit document.
This class holds common methods used in both project documents and family documents.